text = '上午好李先生有什么可以帮您？你好，我就是这个月的那个那个还款的那个是有7千7千多吧，你可不可以给我分十2期。我这边先给您验证1下电话服务密码您看可以吗？好，好。先生请您稍等1下我这边正在为您核实。好，啊。是这样的先生这边为您查询到的是，您这张尾号为，幺幺78的信用卡，本机已经是还清了的您不用担心。就是你这个月的那个返还的那个可不可以帮我那个帮我换1十27。您是想要把什么分成十2期呢？那个要返的那个7千多块钱包申请十2期吗十2期？请您稍等我这边给您查询1下。我这个月他是要放我查了要返7千多块钱你就给我，分十2期吗？啊。您稍等我这边给您查询1下。喂。请您稍等1下这边为您查1下。是这样的先生这边为您查询到的就是，您这个卡片的话目前是有两笔的消费可以做分期的，1笔是3千元1笔是两千8百1十7块钱，您看您需要做分期吗？可以吗？就是还有那个本，本这个月反而要差不多要返1千9百多，然后总共加起来，就1千311笔是3千1天是两千8，还有1笔就是，本身这个月要还1千9百多然后总共加起来有7千多，你把这个7千多住十2期吗？可以吧。是这样的就是说我们这边的话看到您目前，嗯的本机账单已经是还清了的，但是就是说您的总欠款的话还是有的，然后这边的话就是为您查询到，您目前可以分期，可以就是说做账单分期的只有两笔金额1笔是3千元1笔是两千8百1十7元钱。您看这边需要为您把这两笔都做分期吗？可以就是这这两两笔都做分期，好的1笔是3千1定是两千8百1十7呃这种广州的较小的交的总数吗搞个总数吗不要不要？不要分开的作废吗就1起就是总总数来可以吗？啊。请您稍等1下这边给您看1下。好好好。是这样的这边为您查询到的是您这两笔消费的话是在您的位数账单里面是有两笔消费的。就是说我这边的话给您，就是啊，两笔分开就都做分期但是的话就是您的账单还是1起出来的。好。好的，那这边的话就是您这两笔，1笔3千元的1笔两千8百1十7的都要做十2期是吗？对，对。这边的话先提示您这笔3千元的您的分期的期数是，十2期，然后您的，呃这个，最终的手续费率是百分之8点78，您的手续费的支付方式，是1次性收取的。怎么这么多手续费百分之8点接不是百分之7点6吗？可以，百分之0点7了吗？百分之0点76的话是我们的，啊那个元孟津的，是每1期百分之0点机了然后这边为您看到的是您的最终的手续费率，是百分之8档期了然后这个手续费是1次性收取的，您的每期的还款本金是2百5十元，您的手续费的总金额是2百6十2块8毛钱。好。看可以吗？啊那这边再跟您提示这个信息请您稍等1下。是这样的先生这边为您提示几个信息，您的这个账账单的单笔分期的话办理成功以后，就不能更改分期机，金额，和结束了如果您需要提前还款的话已经收的手续费我们就不退了，这个也是还有1次性全额收取的手续费积分7收取手续费的，然后喂收取的手续费我们就不会再收取了，然后您分期的金额，本金，已入账的手续费会占用您0，会占用您的信用额度，但是会随着您每期的还款和主键的恢复的，0。您。办理成功的当天，会冻结该笔分期的金额，在当天系统结算之后，就次日就会返还给您了，建议您当天就暂时不要使用卡片了。好，啊。请您稍等1下，是这样的先生您这边办理业务的话如果您是有任何的疑问的话可以随时致电我行的客服热线。您看可以吗？那请您稍等1下这边正在为您办理。哦你办理都是发短信吗手机短信吗原先你们就是？我们不要打电话你就会发短信上叫我，啊书什么什么？怎么怎么字母再加再加尾数4位数然后就可以办理，是吧。那这边确实是给您添麻烦了，那这边还要提示您几个关键点，就是说您这个账单单笔分期的话，已经分期的这个原则上是不享受最低还款额的，但是如果您选择最低还款额或者是没有全额还款的话，我行有钱人的您的账户不在适合进行分期还款了，确实，您本次分期的过还款的本金及未还款的手续费，交1次性还清或者是加收违约费用并且利息交易日息万分之5从银行的提交日期。还款日，到帐日是，收取，按月接收福利，最低收费，喂，人民币1元，根根据中国人民银行的此项利率，调整额度调整，作为如果按时还，如果按时还清档期，档期的最低还款额，除收取以上的利息之外，海鹰，按月支付违约金，我们每期，最低还款额未还部分的百分之5，最低收费为人民币2十元，分期期间如果您所有的消费，请按，去按期全额还款，个以上的费用您就都不用担心了请您放心，您看可以吗？我只要返还款你给我分配了十2期我没被没被都发好了就可以了吗？我我不会搞吗？吧都全额还款的话上面的费用您就不用担心了。那请您稍等这边正在为您做操作。9，这个记录有6十1年。这样的先生，这边的话就是在为您那笔的2千8百1十7元的分期做十2期可以吗？可以。那这边的话就是您的实际分期金额是2千8百1十7元，然后您的基数是十2期，您的最终的手续费率是，百分之8点76，然后您这个手续费的话也是支付方式是1次性收取的，然后您的手机，啊您的，每期的还款本金是，两千嗯两百3十4块7毛5，然后您的手续费总金额是两百4十6块7毛7，然后刚刚跟您以上，就您那笔3千元的分期提示的关键是1样的，您看您看1下可以吗？可以吗我是说？我是说，手机要还两千多吗？喂。稍等我这边再给您看1下请您稍等。手机怎么又返两千多的？也不是说。两千多是，啊您每期的还款本金是两百3十4块7毛5，然后手续费的总金额是两百4十6块7毛7非常抱歉。哦哦，好的。我这边的话就是给您下班了可以吗？就是以上给您提示的关键点跟您那个3千元的关键的是1样的。哦。好的那这边的话，把您的内笔，两千8百1十7的也已经是下班了您看1下有什么其他可以帮您的吗？不用了吗？就是我就是想问1下，就是您把那个3千现在流量包的那个两批，已经分期以后就是分成十2个月，包这个利息1次性付清，以后我们只要把某1个月每个月返了你就不被，要扣我们什么什么滞纳金打什么？这边的话刚刚也跟您提示了就是说分期的期间如果您所有的消费，是按7，全额还款的话题上面那些费用的话您就都不用担心了都不会产生。费用交交过费短信吗怎么会短信吗？这个请您放心。好好好的。看1下有什么其他可以帮您的吗？没有，啊他们这边。您的来电祝您生活愉快再见。'
import jieba.analyse
import pandas as pd



def is_chinese(uchar):
    #判断是不是汉字
    if uchar >= u'\u4e00' and uchar <= u'\u9fa5':
        return True
    else:
        return False

def is_number(uchar):
    """判断一个unicode是否是数字"""
    if uchar >= u'\u0030' and uchar <= u'\u0039':
        return True
    else:
        return False

def is_alphabet(uchar):
    """判断一个unicode是否是英文字母"""
    if (uchar >= u'\u0041' and uchar <= u'\u005a') or (uchar >= u'\u0061' and uchar <= u'\u007a'):
        return True
    else:
        return False

def is_legal(uchar):
    """判断是否非汉字，数字和英文字符"""
    if not (is_chinese(uchar) or is_number(uchar) or is_alphabet(uchar)):
        return False
    else:
        return True

def extract_chinese(line):
    '''提取中文字符'''
    res = ""
    for word in line:
        if is_legal(word):
            res = res + word
    return res
    
def getKeywords_textrank(data,topK=1):
    tagList,speechList = data.ix[:,0],data.ix[:,1] 
    tags,speechs,keys= [],[],[]
    for index in range(len(tagList)):
        text = '%s。%s' % (tagList[index], speechList[index]) # 拼接标签和对话
        jieba.analyse.set_stop_words("stopwords.txt") # 加载自定义停用词表
        #print("\"",tagList[index],"\"" , " 10 Keywords - TextRank :")
        keywords = jieba.analyse.textrank(text, topK=topK, allowPOS=('n','nz','v','vd','vn','l','a','d'))  
        # TextRank关键词提取，词性筛选
        word_split = " ".join(keywords)
        #print(word_split)
        keys.append(word_split)
        tags.append(tagList[index])
        speechs.append(speechList[index])
    result = pd.DataFrame({"tags": tags, "key": keys}, columns=['tags', 'key'])
    return result

def main():
    dataFile = 'data_pro.csv'
    data = pd.read_csv(dataFile)
    result = getKeywords_textrank(data,20)
    result.to_csv("keys_TextRank_20_new_new.csv",index=False)

# def stopwordslist():
#     stopwords = [line.strip() for line in open('chinsesstoptxt.txt',encoding='UTF-8').readlines()]
#     return   
if __name__ == '__main__':
    main()
